========================================================
2022.09.03 L1-L4
========================================================
пример простейшего класса:

class App {
        piblic static void main (String[] args){
            System.out.println ("Hello, World!");
        }
}

https://checkstyle.sourceforge.io/checks.html

========================================================
2022.09.04 L5-
Мат операции

class App {
        Public static void main (String[] args) {
            System.out.println (3+4);
        }
}
System.otu.println (8/2);
System.out.println (3*3*3);

Основные моменты лекции 5 : Операторы, комутативные операции (перемена мест слагаемых сумма неизменяется), композиция операций, приоритет операций, числа с плавающей точкой.

========================================================
H/W L5
========================================================
Напишите программу, которая считает и последовательно выводит на экран значения следующих математических выражений:
-8 разделить на -4
остаток от деления 100 на 3
сумму двух предыдущих операций

class App {
    public static void printResult(String[] args) {
        // BEGIN (write your solution here)
        System.out.println((-8)/(-4));
        System.out.println(100%3);
        System.out.println(((-8)/(-4))+(100%3));
        // END
    }
}

========================================================
