========================================================
2022.09.03 L1-L4
========================================================
пример простейшего класса:

class App {
        piblic static void main (String[] args){
            System.out.println ("Hello, World!");
        }
}

https://checkstyle.sourceforge.io/checks.html

========================================================
2022.09.04 L5-
Мат операции

class App {
        Public static void main (String[] args) {
            System.out.println (3+4);
        }
}
System.otu.println (8/2);
System.out.println (3*3*3);

Основные моменты лекции 5 : Операторы, комутативные операции (перемена мест слагаемых сумма неизменяется), композиция операций, приоритет операций, числа с плавающей точкой.

========================================================
H/W L5
========================================================
Напишите программу, которая считает и последовательно выводит на экран значения следующих математических выражений:
-8 разделить на -4
остаток от деления 100 на 3
сумму двух предыдущих операций

class App {
    public static void printResult(String[] args) {
        // BEGIN (write your solution here)
        System.out.println((-8)/(-4));
        System.out.println(100%3);
        System.out.println(((-8)/(-4))+(100%3));
        // END
    }
}

========================================================
l6
Кавычки, Экранирующие последовательности, конкатенация

символ экранирования \
перенос коретки \n (line feed) в Windows \r\n

Конкатенация строк через +

========================================================
l7 
Переменные, Изменение переменной, Ошибки при работе с переменными, выражения в опредлениях, переменные и конкатенация, константы

объявление переменной - var greeting = "Father!";
Имена переменных регистрозависимы, нельзя начинать с цифры
Для удобства переменные принято создавать наиболее близко к месту использования.
Java статически типизированный язык - тип переменной задается при определении и больше не меняется.
ТИПОВЫЕ ОШИБКИ
переменная должна быть определена до ее исопльзования., объявление уже объявленной переменной.
ВЫРАЖЕНИЯ В ОПРЕДЛЕНИЯХ
КОНСТАНТЫ 
final var PI = 3.14; - Константы принято именовать в ВЕРХНЕМ_РЕГИСТРЕ
========================================================
l8
Именование, Именование переменных, магические числа.

общие правила - не использовать транслит (только английский).
В именовании 3 основных подхода, которые комбинируют друг с другом:
1. kebab-case - составные части переменной разделяются дефисом. прим - my-super-var
2. snake_case - для разделения используется подчеркивание . прим -my_super_var
3. CamelCase - каждое слово в переменной пишется с заглавной буквы. Например MySuperVar
4. lowerCamelCase - каждое слово перменной пишется с заглавной буквы, кроме первого. прим mySyperVar.
В Java используется CamelCase и его вариация lowerCamelCase.

