========================================================
2022.09.03 L1-L4
========================================================
пример простейшего класса:

class App {
        piblic static void main (String[] args){
            System.out.println ("Hello, World!");
        }
}

https://checkstyle.sourceforge.io/checks.html

========================================================
2022.09.04 L5-L8
Мат операции

class App {
        Public static void main (String[] args) {
            System.out.println (3+4);
        }
}
System.otu.println (8/2);
System.out.println (3*3*3);

Основные моменты лекции 5 : Операторы, комутативные операции (перемена мест слагаемых сумма неизменяется), композиция операций, приоритет операций, числа с плавающей точкой.

========================================================
H/W L5
========================================================
Напишите программу, которая считает и последовательно выводит на экран значения следующих математических выражений:
-8 разделить на -4
остаток от деления 100 на 3
сумму двух предыдущих операций

class App {
    public static void printResult(String[] args) {
        // BEGIN (write your solution here)
        System.out.println((-8)/(-4));
        System.out.println(100%3);
        System.out.println(((-8)/(-4))+(100%3));
        // END
    }
}

========================================================
l6
Кавычки, Экранирующие последовательности, конкатенация

символ экранирования \
перенос коретки \n (line feed) в Windows \r\n

Конкатенация строк через +

========================================================
l7 
Переменные, Изменение переменной, Ошибки при работе с переменными, выражения в опредлениях, переменные и конкатенация, константы

объявление переменной - var greeting = "Father!";
Имена переменных регистрозависимы, нельзя начинать с цифры
Для удобства переменные принято создавать наиболее близко к месту использования.
Java статически типизированный язык - тип переменной задается при определении и больше не меняется.
ТИПОВЫЕ ОШИБКИ
переменная должна быть определена до ее исопльзования., объявление уже объявленной переменной.
ВЫРАЖЕНИЯ В ОПРЕДЛЕНИЯХ
КОНСТАНТЫ 
final var PI = 3.14; - Константы принято именовать в ВЕРХНЕМ_РЕГИСТРЕ
========================================================
l8
Именование, Именование переменных, магические числа.

общие правила - не использовать транслит (только английский).
В именовании 3 основных подхода, которые комбинируют друг с другом:
1. kebab-case - составные части переменной разделяются дефисом. прим - my-super-var
2. snake_case - для разделения используется подчеркивание . прим -my_super_var
3. CamelCase - каждое слово в переменной пишется с заглавной буквы. Например MySuperVar
4. lowerCamelCase - каждое слово перменной пишется с заглавной буквы, кроме первого. прим mySyperVar.
В Java используется CamelCase и его вариация lowerCamelCase.

========================================================
2022.09.05 L9-

Типы данных, Явная типизация, какие бывают типы, значение по умолчанию, значение null, явное преобразование типов

глобально типы в Java делятся на две большие группы:

\\\Примитивные. Предопределены в Java. имена примитивных типов начинаются с нижнего регистра (int).
Примитивные данные всегда имеют значение, даже если они определяются без инициализации.
byte (Байт -128..127), short (2 байта), int ( 4 байта), long (8 байт) ЦЕЛЫЕ ЧИСЛА
float, double, РАЦИОАНЛЬНЫЕ ЧИЛСА
boolean, char

Самые частые типы - int, double, boolean

char ch ='a'; - определятеся через одинарные кавычки. Извлечение символва из строки "hexlet".charAt(1); // e

\\\Ссылочные (не примитивные). Создаются самим программистом (кроме String и Array) имена ссылочных с верхнего (Sting)
значение null. используется для ссылочных типов, когда значение не определено.

\\преобразование типов:
var number = Integer.parseInt ("345");
var result = (int) 5.1 ;
Преобразование можно использовать внутри составных выражений.
var result = 10 + ((int) 5.1);

========================================================
l9
Вызов методов, параметры методов, несколько параметров, значения по умолчанию
методы - это действия, которые нужно выполнить над данными, к которым они применяются.
Объекты - данные у которые есть методы. В Java все не примитивные (ссылочные) типы данных - это объекты.
.lenght(); .toUpperCase();
в вызов метода можно передавать параметры.  .charAt(0); параметров может быть больше одного .replace("go", "mo"); 
Параметры могут содержать значение по умолчанию .substring(1)- извлечть подстроку со 2 символа. .substring(1,3) со второго до 4.